
/* Presented when a URL cannot be loaded because its scheme isn't understood */
"Don't know how to load URL %@" = "Osoitetta %@ ei osata ladata";

/* Presented when an HTTP URL cannot establish a connection with a particular host */
"Could not connect to host %@" = "Palvelimeen %@ ei saada yhteyttä";

/* Presented when a response from an HTTP server comes back with a bad format */
"Bad header received from server" = "Palvelimelta saatu virheellinen otsake";

/* Presented when a description of a particular host can't be determined. */
"Can't determine IP address of host: %@" = "Palvelimen %@ IP-osoitetta ei voida määrittää";

/* Presented when the host description was found, but a particular port couldn't be opened. */
"Can't get a description of port %d" = "Portin %d kuvausta ei voida hakea";

/* Presented when a particular host cannot be contacted via the given port */
"Can't connect to host %@ using port %d" = "Palvelimeen %@ ei voida yhdistää käyttäen porttia %d";

/* Presented when an HTTP server comes back with an unknown status code */
"Received unknown HTTP server response %@: %@" = "Vastaanotettu tuntematon HTTP-palvelinvastaus %@: %@";

/* Presented when an HTTP server returns a failure code */
"HTTP request failed for URL %@:%@" = "HTTP-pyyntö epäonnistui osoitteelle %@:%@";

/* Presented when the connection to an HTTP server is unexpectedly lost */
"Lost connection to host %@" = "Yhteys palvelimeen %@ on menetetty";

/* Presented when a file can not be opened for reading (file may not exist) */
"Could not read from %@" = "Kohteesta %@ ei voida lukea";

/* Presented when a redirection loop has been detected */
"Detected a redirection loop while attempting to load URL %@" = "On havaittu uudelleenohjaussilmukka yritettäessä ladata osoitetta %@";

/* Presented when an FTP server hangs up or becomes otherwise unavailable */
"Service unavailable for host %@" = "Palvelu ei ole käytettävissä palvelimelle %@";

/* Presented when the data transfer socket cannot be created for an FTP transfer */
"Couldn't open data connection for URL path: %@" = "Osoitepolulle %@ ei voitu avata datayhteyttä";

/* Presented when the indicated URL does not locate ane existing object on the server */
"Object not available for specified URL: %@" = "Kohde ei ole käytettävissä määritellyllä osoitteella: %@";

/* Presented when the FTP server doesn't recognize a particular command */
"FTP command not recognized by host: %@" = "FTP-komentoa ei tunnistettu, palvelin: %@";

/* Presented when the FTP server rejects an authentication */
"User login or password not recognized." = "Käyttäjätunnusta tai salasanaa ei tunnistettu.";

/* Format used to display sizes 100 GB or greater */
"%.0f GB" = "%.0f Gt";

/* Format used to display sizes between 100 and 999 KB */
"%.0f KB" = "%.0f Kt";

/* Format used to display sizes between 100 and 999 MB */
"%.0f MB" = "%.0f Mt";

/* Format used to display a size between 2 and 100 bytes */
"%.0f bytes" = "%.0f tavua";

/* Format used to display sizes between 1000 MB and 9.9 GB */
"%.1f GB (1.0)" = "%.1f Gt";

/* Format used to display sizes between 10 and 99.9 GB */
"%.1f GB (10.0)" = "%.1f Gt";

/* Format used to display sizes between 100 and 999 bytes */
"%.1f KB (0.1)" = "%.1f Kt";

/* Format used to display sizes between 1000 bytes and 9.9 KB */
"%.1f KB (1.0)" = "%.1f Kt";

/* Format used to display sizes between 10 and 99.9 KB */
"%.1f KB (10.0)" = "%.1f Kt";

/* Format used to display sizes between 1000 KB and 9.9 MB */
"%.1f MB (1.0)" = "%.1f Mt";

/* Format used to display sizes between 10 and 99.9 MB */
"%.1f MB (10.0)" = "%.1f Mt";

/* Format string for label of a saved password in Keychain: URL (USERNAME) */
"%@ (%@)" = "%@ (%@)";

/* Format used to partial byte count along with total */
"%@ of %@" = "%@ / %@";

/* String used for showing a zero byte size */
"0 bytes" = "0 tavua";

/* String used for showing a one byte size */
"1 byte" = "1 tavu";

/* WebFoundationErrorCannotCreateFile description */
"Cannot create file" = "Tiedostoa ei voida luoda";

/* WebFoundationErrorCannotMoveFile description */
"Cannot move file" = "Tiedostoa ei voida siirtää";

/* WebFoundationErrorCannotOpenFile description */
"Cannot open file" = "Tiedostoa ei voida avata";

/* WebFoundationErrorCannotRemoveFile description */
"Cannot remove file" = "Tiedostoa ei voida poistaa";

/* WebFoundationErrorCannotWriteToFile description */
"Cannot write file" = "Tiedostoa ei voida kirjoittaa";

/* WebFoundationErrorDNSLookupError description */
"DNS lookup error" = "Nimipalveluvirhe";

/* WebFoundationErrorDownloadDecodingFailedMidStream description */
"Download decoding failed (at end)" = "Haetun tiedoston purkaminen epäonnistui (lopussa)";

/* WebFoundationErrorDownloadDecodingFailedToComplete description */
"Download decoding failed (midstream)" = "Haettavan tiedoston purkaminen epäonnistui (keskellä)";

/* WebFoundationErrorCannotCloseFile description */
"Failure occurred while closing file" = "Tiedostoa suljettaessa tapahtui virhe";

/* Kind string used for keychain items from forms-based logins */
"Web form password" = "Web-lomakkeen salasana";

/* HTTP result code string */
"accepted" = "hyväksytty";

/* WebFoundationErrorBadURLError description */
"bad URL" = "virheellinen osoite";

/* HTTP result code string */
"bad gateway" = "virheellinen yhdyskäytävä";

/* HTTP result code string */
"bad request" = "virheellinen pyyntö";

/* WebFoundationErrorServerCertificateHasUnknownRoot description */
"bad server certificate" = "virheellinen palvelinvarmenne";

/* WebFoundationErrorBadServerResponseError description */
"bad server response" = "virheellinen palvelinvastaus";

/* WebFoundationErrorCannotDecodeRawData description */
"cannot decode raw data" = "raakadataa ei voida purkaa";

/* WebFoundationErrorCannotDecodeContentData description */
"cannot decode content data" = "sisältödataa ei voida purkaa";

/* WebFoundationErrorCannotParseResponse description */
"cannot parse response" = "vastausta ei voida jäsentää";

/* WebFoundationErrorCancelled description */
"cancelled" = "peruttu";

/* WebFoundationErrorCannotConnectToHostError description */
"can't connect to host" = "ei yhteyttä palvelimeen";

/* WebFoundationErrorCannotFindHostError description */
"can't find host" = "palvelinta ei löydy";

/* WebFoundationErrorCannotLoadFromNetworkError description */
"can't load from network" = "verkosta ei voida ladata";

/* HTTP result code string */
"client error" = "asiakasvirhe";

/* HTTP result code string */
"conflict" = "konflikti";

/* HTTP result code string */
"continue" = "jatka";

/* HTTP result code string */
"created" = "luotu";

/* WebFoundationErrorReadStreamError description */
"error reading stream" = "virhe luettaessa virtaa";

/* HTTP result code string */
"expectation failed" = "odotus epäonnistui";

/* WebFoundationErrorServerCertificateHasBadDate description */
"expired server certificate" = "vanhentunut palvelinvarmenne";

/* WebFoundationErrorFileDoesNotExist description */
"file doesn't exist" = "tiedostoa ei ole";

/* WebFoundationErrorFileIsDirectory description */
"file is directory" = "tiedosto on hakemisto";

/* HTTP result code string */
"forbidden" = "kielletty";

/* HTTP result code string */
"found" = "löytyi";

/* HTTP result code string */
"gateway timed out" = "yhdyskäytävän aikakatkaisu";

/* HTTP result code string */
"informational" = "tietoa antava";

/* HTTP result code string */
"internal server error" = "palvelimen sisäinen virhe";

/* HTTP result code string */
"length required" = "pituus vaaditaan";

/* WebFoundationErrorNetworkConnectionLostError description */
"lost network connection" = "verkkoyhteys katkesi";

/* HTTP result code string */
"method not allowed" = "menetelmä ei sallittu";

/* HTTP result code string */
"moved permanently" = "siirretty pysyvästi";

/* HTTP result code string */
"multiple choices" = "useita valintoja";

/* HTTP result code string */
"needs proxy" = "tarvitaan välipalvelin";

/* WebFoundationErrorNotConnectedToInternetError description */
"no Internet connection" = "ei internet-yhteyttä";

/* HTTP result code string */
"no content" = "ei sisältöä";

/* HTTP result code string */
"no error" = "ei virhettä";

/* HTTP result code string */
"no longer exists" = "ei ole enää olemassa";

/* WebFoundationErrorNoPermissionsToReadFile description */
"no permissions to read file" = "ei oikeuksia tiedoston lukuun";

/* HTTP result code string */
"non-authoritative information" = "varmentamaton tieto";

/* HTTP result code string */
"not found" = "ei löydy";

/* HTTP result code string */
"not modified" = "ei muutettu";

/* HTTP result code string */
"partial content" = "osittainen sisältö";

/* HTTP result code string */
"payment required" = "maksu vaaditaan";

/* HTTP result code string */
"precondition failed" = "ennakkoehto epäonnistui";

/* HTTP result code string */
"proxy authentication required" = "välipalvelimen autentikointi vaaditaan";

/* HTTP result code string */
"redirected" = "uudelleenohjattu";

/* WebFoundationErrorRedirectToNonExistentLocation description */
"redirected to nowhere" = "uudelleenohjattu ei mihinkään";

/* HTTP result code string */
"request timed out" = "pyynnön aikakatkaisu";

/* HTTP result code string */
"request too large" = "pyyntö liian suuri";

/* HTTP result code string */
"requested URL too long" = "pyydetty osoite liian pitkä";

/* HTTP result code string */
"requested range not satisfiable" = "pyydetty alue epätyydyttävä";

/* HTTP result code string */
"reset content" = "palautettu sisältö";

/* WebFoundationErrorResourceUnavailableError description */
"resource unavailable" = "resurssi ei käytettävissä";

/* WebFoundationErrorSecureConnectionFailed description */
"secure connection failed" = "salattu yhteys epäonnistui";

/* HTTP result code string */
"see other" = "katso muut";

/* HTTP result code string */
"server error" = "palvelinvirhe";

/* HTTP result code string */
"service unavailable" = "palvelu ei käytettävissä";

/* HTTP result code string */
"success" = "onnistui";

/* HTTP result code string */
"switching protocols" = "vaihdan protokollia";

/* HTTP result code string */
"temporarily redirected" = "tilapäisesti uudelleenohjattu";

/* WebFoundationErrorTimedOut description */
"timed out" = "aikakatkaisu";

/* WebFoundationErrorHTTPTooManyRedirectsError description */
"too many HTTP redirects" = "liikaa HTTP-uudelleenohjauksia";

/* HTTP result code string */
"unacceptable" = "ei kelpaa";

/* HTTP result code string */
"unauthorized" = "valtuuttamaton";

/* HTTP result code string */
"unimplemented" = "ei toteutettu";

/* Unknown filename */
"unknown" = "tuntematon";

/* WebFoundationErrorUnsupportedURL description */
"unsupported URL" = "ei tuettu osoite";

/* HTTP result code string */
"unsupported media type" = "ei tuettu mediatyyppi";

/* HTTP result code string */
"unsupported version" = "ei tuettu versio";

/* WebFoundationErrorServerCertificateUntrusted description */
"untrusted server certificate" = "ei luotettu palvelinvarmenne";

/* WebFoundationErrorZeroByteResourceError description */
"zero byte resource" = "nollatavuinen resurssi";

/* WebFoundationErrorDataLengthExceedsMaximum description */
"resource exceeds maximum size" = "resurssi ylittää enimmäiskoon";
